eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/src/em_acmp.c
#if defined(_SILICON_LABS_32B_SERIES_2)
  acmp->IEN         = _ACMP_IEN_RESETVALUE;
  ACMP_Enable(acmp);
  acmp->INPUTCTRL   = _ACMP_INPUTCTRL_RESETVALUE;
  ACMP_Disable(acmp);
  acmp->CFG         = _ACMP_CFG_RESETVALUE;
  acmp->CTRL        = _ACMP_CTRL_RESETVALUE;
  acmp->IF_CLR      = _ACMP_IF_MASK;
#else // Series 0 and Series 1 devices
  acmp->IEN         = _ACMP_IEN_RESETVALUE;
  acmp->CTRL        = _ACMP_CTRL_RESETVALUE;
  acmp->INPUTSEL    = _ACMP_INPUTSEL_RESETVALUE;
#if defined(_ACMP_HYSTERESIS0_HYST_MASK)
  acmp->HYSTERESIS0 = _ACMP_HYSTERESIS0_RESETVALUE;
  acmp->HYSTERESIS1 = _ACMP_HYSTERESIS1_RESETVALUE;
#endif
  acmp->IFC         = _ACMP_IF_MASK;
#endif
}

#if defined(_GPIO_ACMP_ROUTEEN_MASK)
/***************************************************************************//**
 * @brief
 *   Sets up GPIO output from the ACMP.
 *
 * @note
 *    GPIO must be enabled in the CMU before this function call, i.e.
 * @verbatim CMU_ClockEnable(cmuClock_GPIO, true); @endverbatim
 *
 * @param[in] acmp
 *   Pointer to the ACMP peripheral register block.
 *
 * @param port
 *   The GPIO port to use.
 *
 * @param pin
 *   The GPIO pin to use.
 *
 * @param enable
 *   Enable or disable pin output.
 *
 * @param invert
 *   Invert output.
 ******************************************************************************/
void ACMP_GPIOSetup(ACMP_TypeDef *acmp, GPIO_Port_TypeDef port,
                    unsigned int pin, bool enable, bool invert)
{
  int acmpIndex = ACMP_DEVICE_ID(acmp);

  /* Make sure the module exists on the selected chip */
  EFM_ASSERT(ACMP_REF_VALID(acmp));

  /* Make sure that the port/pin combination is valid. */
  EFM_ASSERT(GPIO_PORT_PIN_VALID(port, pin));

  /* Set GPIO inversion */
  acmp->CTRL = (acmp->CTRL & _ACMP_CTRL_NOTRDYVAL_MASK)
               | (invert << _ACMP_CTRL_GPIOINV_SHIFT);

  GPIO->ACMPROUTE[acmpIndex].ACMPOUTROUTE = (port << _GPIO_ACMP_ACMPOUTROUTE_PORT_SHIFT)
                                            | (pin << _GPIO_ACMP_ACMPOUTROUTE_PIN_SHIFT);
  GPIO->ACMPROUTE[acmpIndex].ROUTEEN  = enable ? GPIO_ACMP_ROUTEEN_ACMPOUTPEN : 0;
}
#else
/***************************************************************************//**
 * @brief
 *   Set up GPIO output from ACMP.
 *
 * @note
 *    GPIO must be enabled in the CMU before this function call, i.e.,
 * @verbatim CMU_ClockEnable(cmuClock_GPIO, true); @endverbatim
 *
 * @param[in] acmp
 *   A pointer to the ACMP peripheral register block.
 *
 * @param location
 *   The pin location to use. See the data sheet for location to pin mappings.
 *
 * @param enable
 *   Enable or disable pin output.
 *
 * @param invert
 *   Invert output.
 ******************************************************************************/
void ACMP_GPIOSetup(ACMP_TypeDef *acmp, uint32_t location, bool enable, bool invert)
{
  /* Make sure the module exists on the selected chip */
  EFM_ASSERT(ACMP_REF_VALID(acmp));

  /* Sanity checking of location */
  EFM_ASSERT(location <= _ACMP_ROUTE_LOCATION_MAX);

  /* Set GPIO inversion */
  BUS_RegMaskedWrite(&acmp->CTRL, _ACMP_CTRL_GPIOINV_MASK,
                     invert << _ACMP_CTRL_GPIOINV_SHIFT);

#if defined(_ACMP_ROUTE_MASK)
  acmp->ROUTE = (location << _ACMP_ROUTE_LOCATION_SHIFT)
                | (enable << _ACMP_ROUTE_ACMPPEN_SHIFT);
#endif
#if defined(_ACMP_ROUTELOC0_MASK)
  acmp->ROUTELOC0 = location << _ACMP_ROUTELOC0_OUTLOC_SHIFT;
  acmp->ROUTEPEN  = enable ? ACMP_ROUTEPEN_OUTPEN : 0;
#endif
}
#endif /* defined(_GPIO_ACMP_ROUTEEN_MASK) */

/***************************************************************************//**
 * @brief
 *   Set which channels should be used in ACMP comparisons.
 *
 * @cond DOXYDOC_S2_DEVICE
 * @note
 *   Can only be called when the peripheral is enabled.
 *
 * @note
 *   If GPIO is used for both posSel and negSel, they cannot both use even
 *   or odd pins.
 * @endcond
 *
 * @param[in] acmp
 *   A pointer to the ACMP peripheral register block.
 *
 * @param negSel
 *   A channel to use on the negative input to the ACMP.
 *
 * @param posSel
 *   A channel to use on the positive input to the ACMP.
 ******************************************************************************/
void ACMP_ChannelSet(ACMP_TypeDef *acmp, ACMP_Channel_TypeDef negSel,
                     ACMP_Channel_TypeDef posSel)
{
  /* Make sure the module exists on the selected chip. */
  EFM_ASSERT(ACMP_REF_VALID(acmp));

  /* Make sure that posSel and negSel channel selectors are valid. */
#if defined(_ACMP_INPUTSEL_NEGSEL_DAC0CH1)
  EFM_ASSERT(negSel <= _ACMP_INPUTSEL_NEGSEL_DAC0CH1);
#elif defined(_ACMP_INPUTSEL_NEGSEL_CAPSENSE)
  EFM_ASSERT(negSel <= _ACMP_INPUTSEL_NEGSEL_CAPSENSE);
#endif

#if defined(_ACMP_INPUTSEL_POSSEL_CH7)
  EFM_ASSERT(posSel <= _ACMP_INPUTSEL_POSSEL_CH7);
#endif

  /* Make sure that posSel and negSel channel selectors are valid. */
#if defined(_ACMP_INPUTCTRL_POSSEL_PD15)
  EFM_ASSERT(negSel <= _ACMP_INPUTCTRL_POSSEL_PD15);
  EFM_ASSERT(posSel <= _ACMP_INPUTCTRL_POSSEL_PD15);
  EFM_ASSERT(posSel != _ACMP_INPUTCTRL_NEGSEL_CAPSENSE);

  /* Make sure that posSel and negSel channel selectors don't both
   * use odd or even pins. */
  EFM_ASSERT(!((posSel >= _ACMP_INPUTCTRL_POSSEL_PA0)
               && (negSel >= _ACMP_INPUTCTRL_NEGSEL_PA0)
               && (posSel % 2 == negSel % 2)));
#endif

#if defined(_ACMP_INPUTCTRL_MASK)
  /* Make sure that the ACMP is enabled before changing INPUTCTRL. */
  EFM_ASSERT(acmp->EN & ACMP_EN_EN);
  while (acmp->SYNCBUSY != 0U) {
    /* Wait for synchronization to finish */
  }
  acmp->INPUTCTRL = (acmp->INPUTCTRL & ~(_ACMP_INPUTCTRL_POSSEL_MASK
                                         | _ACMP_INPUTCTRL_NEGSEL_MASK))
                    | (negSel << _ACMP_INPUTCTRL_NEGSEL_SHIFT)
                    | (posSel << _ACMP_INPUTCTRL_POSSEL_SHIFT);
#else
  acmp->INPUTSEL = (acmp->INPUTSEL & ~(_ACMP_INPUTSEL_POSSEL_MASK
                                       | _ACMP_INPUTSEL_NEGSEL_MASK))
                   | (negSel << _ACMP_INPUTSEL_NEGSEL_SHIFT)
                   | (posSel << _ACMP_INPUTSEL_POSSEL_SHIFT);
#endif
}

/***************************************************************************//**
 * @brief
 *   Initialize ACMP.
 *
 * @cond DOXYDOC_S2_DEVICE
 * @note
 *   A call to ACMP_Init can cause side effects since it can enable/disable
 *   the peripheral.
 * @endcond
 *
 * @param[in] acmp
 *   A pointer to the ACMP peripheral register block.
 *
 * @param[in] init
 *   A pointer to the initialization structure used to configure ACMP.
 ******************************************************************************/
void ACMP_Init(ACMP_TypeDef *acmp, const ACMP_Init_TypeDef *init)
{
  /* Make sure the module exists on the selected chip. */
  EFM_ASSERT(ACMP_REF_VALID(acmp));

